{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Advanced Diploma of Software Engineering Technology",
      "department": "Electrical and Computer Engineering",
      "duration": "2017-2020",
      "school_name": "Centennial College"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor Degree of Architecture",
      "department": "Architecture",
      "duration": "2005-2011",
      "school_name": "Hoseo University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_YerinAn",
  "highlighted_projects": [
    {
      "description": "Created an application that any company or customer can make their online website based on their products and analyze the online business. Worked with Java 11, Vue, Javascript, Spring boot, and Microsoft SQL Server.",
      "git_url": "https://github.com/caiquebispoferreira/resourceserver",
      "name": "MODERN ERP application"
    },
    {
      "description": "Designed a web application which is a space shooting game that uses Typescript, Javascript and CreateJs, and it works with a keyboard. Adjusted three stages that the difficulty level through different enemies, options, items and a high scoreboard.",
      "git_url": "https://github.com/Calvin05/WebGamming-Group1",
      "name": "WebGaming - Space defenders"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed an internal tool to collect and save both server hardware specifications and on-going Linux resource usage data so that users can know their cluster status better, such as Utilized the docker container to provision the database, Created bash scripts for monitoring nodes, and Developed SQL queries to store and retrieve data.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Twitter App allows users to post, get, and delete tweets from Twitter with a developer account. It uses MVC(Model-View-Controller) design pattern to manage the code structure. The Rest APIs interact with Twitter, Maven and Spring as dependency managers, JUnit and Mockito for testing, and Docker for the deployment.",
        "JDBC App: Implemented an application that uses JDBC to build a connection between Java and PostgreSQL database. developed CRUD operations by using the DAO design pattern.",
        "Grep App: Developed an application that has the functionality to a simplified the Linux grep command using Java. Used the lambda function and stream API from Java 8 to optimize the final project performance. Maven and Docker were used to building, deploying and running the app."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Trading App is an online stock trading simulator using a REST API that returns JSON documents to users. It retrieves the real stock market information using IEX Cloud API(IEX Cloud has delayed stock information), saves and persists data into a database. And, this application allows users to manage client profiles and accounts, monitor portfolio performance, and trade securities.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "Implemented a data analysis project to help a retail organization figure out decreasing revenue recently. To answer the necessary business questions, analyzing data is essential to do. So, Using a PostgreSQL instance as a data warehouse and Python Pandas/Jupyter to perform OLAP operations and segmented customers (using RFM Segmentation) into important categories to help the company develop targeted marketing strategies",
      "git_url": "/python_data_analytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Deployed three-nodes Hadoop cluster using Google Cloud Platform Dataproc and performed data processing/analytics using Hive and Zeppelin. Also, evaluated HDFS, MapReduce, and YARN; Using the distributed storage and processing capabilities of the Hadoop ecosystem to examine the 2016 World Development Indicators dataset, optimize it using Parquet and Partitioning for analyzing data.",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "In development",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "In development",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Yerin An",
  "others": [
    {
      "bullets": [
        "Psychology for Digital Behavior Change [DBC1] (2019)",
        "Psychological Architectures of Digital Behavior Change [DBC2] (2019)",
        "Certificate of Completion for the workshop Emotional Design Psychology [EDP] (2019)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Music - composing, DJing, guitar",
        "Competitive gaming",
        "Collecting Lego"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed Data Engineering projects in Java using technologies such as Git, Java, Maven, Docker, Springboot, RDBMS/SQL, Python within a Linux environment. Collaborated with a team in daily Scrum meetings to implement Agile development practices. Used Git Flow in every project for continuous delivery and a scheduled release cycle.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "Centennial College",
      "description": "Migrated a legacy medical application from Flex code to Java 11 using Spring Framework and Angular. Created Spring Rest APIs to persist, merge, delete the patient's private information and hospital records and replaced some Hibernate/JPQL queries with MSSQL/SQL native queries to increase some routers' performance. Also supported the frontend teams with bug triage, troubleshooting/debugging and resolution (Jira for tickets and Confluence for API documentation). Created test stubs for unit testing, system testing and integration testing using JUnit. Participated in Agile Scrum meetings and resolving technical issues that arise during development.",
      "duration": "2020-2021",
      "title": "Backend Developer"
    },
    {
      "company": "AlterSpark-Digital Psychology \u0026 Behaviour Design",
      "description": "Worked as a web developer and assisted our team in migrating a psychological website from bootstrap3 to bootstrap4. Developed a dashboard with charts using Javascript and showing analyzed personal based on the pictures and profiles with some machine learning models. Built heatmaps, charts using HTML, CSS, JavaScript, NodeJS and photo-programs that can resize, reduce resolution, and rename with Python and Django",
      "duration": "2019",
      "title": "UX/UI designer \u0026 Web developer | Co-op"
    }
  ],
  "skills": {
    "competent": [
      "JavaScript",
      "HTML/CSS",
      "Python",
      "Docker",
      "Algorithms/Data structures",
      "Jupyter notebook",
      "Pandas"
    ],
    "familiar": [
      "C#",
      "Vue",
      "Android",
      "React",
      "Angular"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "REST APIs",
      "SpringBoot",
      "Hibernate"
    ]
  },
  "summary": "I am currently a Software and Data Engineer with Jarvis and graduate from Centennial College with an Advanced Diploma of Software Engineering Technology. I have always been passionate about new technology and thinking of integrating technology into our daily lives. And it gives me to motivate and learn that can improve myself. I'm currently a Data Engineer at Jarvis Consulting, where I am being given the opportunity to apply my knowledge and hone my skills with industry-standard tools such as Java, SQL, Springboot, Hadoop, Spark, and Cloud DevOps. Also, I have experience as a back-end developer for around a year, and I worked as a web developer with a co-op program. During that time, I worked with REST APIs, data analytics, and application development, and these experiences helped me become a team-oriented, detail-oriented, and responsible person. I am looking forward to working in data engineering and getting a chance to contribute to the innovations."
}
